In [48]:
import pandas as pd

In [50]:
file_path = "/Users/dineshbosegandhi/Downloads/12th  - dbeaver, raw data createion/Seborn practicle/tips_dataset.csv"

In [3]:
df = pd.read_csv(file_path)

In [4]:
df #select * from table

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [7]:
filter=['day', 'total_bill']

df[filter] #select day, total_bill from table

      day  total_bill
0     Sun       16.99
1     Sun       10.34
2     Sun       21.01
3     Sun       23.68
4     Sun       24.59
..    ...         ...
239   Sat       29.03
240   Sat       27.18
241   Sat       22.67
242   Sat       17.82
243  Thur       18.78

[244 rows x 2 columns]

In [19]:
# select * from table limit 10
df.head(10)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

In [21]:
df['day'].unique() # select distinct(day) from table

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [5]:
#select from tips where day='Thur';
mask = (df['day']=='Thur') | (df['day']=='Sat')
df[mask]

     total_bill   tip     sex smoker   day    time  size
19        20.65  3.35    Male     No   Sat  Dinner     3
20        17.92  4.08    Male     No   Sat  Dinner     2
21        20.29  2.75  Female     No   Sat  Dinner     2
22        15.77  2.23  Female     No   Sat  Dinner     2
23        39.42  7.58    Male     No   Sat  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[149 rows x 7 columns]

In [6]:
# select * from tips order by total_bill
df.sort_values('total_bill')

     total_bill    tip     sex smoker   day    time  size
67         3.07   1.00  Female    Yes   Sat  Dinner     1
92         5.75   1.00  Female    Yes   Fri  Dinner     2
111        7.25   1.00  Female     No   Sat  Dinner     1
172        7.25   5.15    Male    Yes   Sun  Dinner     2
149        7.51   2.00    Male     No  Thur   Lunch     2
..          ...    ...     ...    ...   ...     ...   ...
182       45.35   3.50    Male    Yes   Sun  Dinner     3
156       48.17   5.00    Male     No   Sun  Dinner     6
59        48.27   6.73    Male     No   Sat  Dinner     4
212       48.33   9.00    Male     No   Sat  Dinner     4
170       50.81  10.00    Male    Yes   Sat  Dinner     3

[244 rows x 7 columns]

In [35]:
#SELECT occupation FROM dataset_1 GROUP BY occupation
df.groupby(['day','sex'], as_index=False)['total_bill'].sum()

    day     sex  total_bill
0   Fri  Female      127.31
1   Fri    Male      198.57
2   Sat  Female      551.05
3   Sat    Male     1227.35
4   Sun  Female      357.70
5   Sun    Male     1269.46
6  Thur  Female      534.89
7  Thur    Male      561.44

In [8]:
df.groupby('day').size().to_frame('Count').reset_index()

    day  Count
0   Fri     19
1   Sat     87
2   Sun     76
3  Thur     62

In [14]:
df.groupby(['sex'],as_index=False)['tip'].max()

      sex   tip
0  Female   6.5
1    Male  10.0

In [22]:
df.groupby('sex').size().to_frame('Count').reset_index()

      sex  Count
0  Female     87
1    Male    157

In [25]:

df.groupby(['sex','smoker'])['tip'].max().to_frame('max tip').reset_index()

      sex smoker  max tip
0  Female     No      5.2
1  Female    Yes      6.5
2    Male     No      9.0
3    Male    Yes     10.0

In [32]:
result = df.groupby(['sex','smoker'])['tip'].max().to_frame('max tip').reset_index()

In [39]:
ans = result.query("smoker=='Yes' ")
ans

      sex smoker  max tip
1  Female    Yes      6.5
3    Male    Yes     10.0

In [75]:
!pip install faker
import pandas as pd
from faker import Faker

# 1. Load your dataset
file_path = "/Users/dineshbosegandhi/Downloads/12th  - dbeaver, raw data createion/Seborn practicle/tips_dataset.csv"
df = pd.read_csv(file_path)

# 2. Initialize Faker
fake = Faker()

# 3. Generate customer_id and realistic names
# Starting from 1001 to keep IDs consistent in length
df['customer_id'] = ["CUST_" + str(i) for i in range(1001, 1001 + len(df))]
df['customer_name'] = [fake.name() for _ in range(len(df))]
print(df)
# 4. Reorder columns to put ID and Name first
cols = ['customer_id', 'customer_name'] + [c for c in df.columns if c not in ['customer_id', 'customer_name']]
df = df[cols]
print(df)


# 5. Export to Excel
output_path = "/Users/dineshbosegandhi/Downloads/tips_outlier_report.xlsx"
#df.to_excel(output_path, index=False)

print(f"Success! {len(df)} rows exported to {output_path}")

/bin/bash: pip: command not found
     total_bill   tip     sex smoker   day    time  size customer_id  \
0         16.99  1.01  Female     No   Sun  Dinner     2   CUST_1001
1         10.34  1.66    Male     No   Sun  Dinner     3   CUST_1002
2         21.01  3.50    Male     No   Sun  Dinner     3   CUST_1003
3         23.68  3.31    Male     No   Sun  Dinner     2   CUST_1004
4         24.59  3.61  Female     No   Sun  Dinner     4   CUST_1005
..          ...   ...     ...    ...   ...     ...   ...         ...
239       29.03  5.92    Male     No   Sat  Dinner     3   CUST_1240
240       27.18  2.00  Female    Yes   Sat  Dinner     2   CUST_1241
241       22.67  2.00    Male    Yes   Sat  Dinner     2   CUST_1242
242       17.82  1.75    Male     No   Sat  Dinner     2   CUST_1243
243       18.78  3.00  Female     No  Thur  Dinner     2   CUST_1244

          customer_name
0    Chelsea Fitzgerald
1          Seth Andrews
2          Amanda Reese
3         Chad Robinson
4         Julian Reilly
..                  ...
239     Steven Mckinney
240     Christine Quinn
241         Dana Ortega
242    Michele Thompson
243       Cynthia White

[244 rows x 9 columns]
    customer_id       customer_name  total_bill   tip     sex smoker   day  \
0     CUST_1001  Chelsea Fitzgerald       16.99  1.01  Female     No   Sun
1     CUST_1002        Seth Andrews       10.34  1.66    Male     No   Sun
2     CUST_1003        Amanda Reese       21.01  3.50    Male     No   Sun
3     CUST_1004       Chad Robinson       23.68  3.31    Male     No   Sun
4     CUST_1005       Julian Reilly       24.59  3.61  Female     No   Sun
..          ...                 ...         ...   ...     ...    ...   ...
239   CUST_1240     Steven Mckinney       29.03  5.92    Male     No   Sat
240   CUST_1241     Christine Quinn       27.18  2.00  Female    Yes   Sat
241   CUST_1242         Dana Ortega       22.67  2.00    Male    Yes   Sat
242   CUST_1243    Michele Thompson       17.82  1.75    Male     No   Sat
243   CUST_1244       Cynthia White       18.78  3.00  Female     No  Thur

       time  size
0    Dinner     2
1    Dinner     3
2    Dinner     3
3    Dinner     2
4    Dinner     4
..      ...   ...
239  Dinner     3
240  Dinner     2
241  Dinner     2
242  Dinner     2
243  Dinner     2

[244 rows x 9 columns]
Success! 244 rows exported to /Users/dineshbosegandhi/Downloads/tips_outlier_report.xlsx

In [51]:
# The '!' tells the notebook to run this as a terminal command
%pip install Faker openpyxl

Requirement already satisfied: Faker in /usr/local/anaconda3/lib/python3.13/site-packages (40.4.0)
Requirement already satisfied: openpyxl in /usr/local/anaconda3/lib/python3.13/site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in /usr/local/anaconda3/lib/python3.13/site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [58]:
input_path = "/Users/dineshbosegandhi/Downloads/tips_outlier_report.xlsx"

df_tips = pd.read_excel(input_path)
df_tips

,customer_id,customer_name,total_bill,tip,sex,smoker,day,time,size
0,CUST_1001,Jennifer Peterson,16.99,1.01,Female,No,Sun,Dinner,2
1,CUST_1002,Mrs. Monique Vance,10.34,1.66,Male,No,Sun,Dinner,3
2,CUST_1003,Angelica West,21.01,3.50,Male,No,Sun,Dinner,3
3,CUST_1004,Courtney Horne,23.68,3.31,Male,No,Sun,Dinner,2
4,CUST_1005,John Young,24.59,3.61,Female,No,Sun,Dinner,4
...,...,...,...,...,...,...,...,...,...
239,CUST_1240,Molly Spencer,29.03,5.92,Male,No,Sat,Dinner,3
240,CUST_1241,Jenna White,27.18,2.00,Female,Yes,Sat,Dinner,2
241,CUST_1242,Shawn Krueger,22.67,2.00,Male,Yes,Sat,Dinner,2
242,CUST_1243,Stacy Mccoy,17.82,1.75,Male,No,Sat,Dinner,2
243,CUST_1244,Katherine Murphy,18.78,3.00,Female,No,Thur,Dinner,2

In [73]:
result = df.groupby(['smoker', 'customer_name'], as_index=False)['tip'].max()
  
#SELECT weather ,MAX(temperature) AS max_temp FROM dataset_1 GROUP BY weather

df.groupby('smoker')['tip'].sum().to_frame('max_tip').reset_index()

  smoker  max_tip
0     No   451.77
1    Yes   279.81

In [90]:
cols = ['test']  + [c for c in df_tips.columns]
df['customer_id'] = ["CUST_" + str(i) for i in range(1001, 1001 + len(df))]

df_tips['name'] =  [fake.name()  for i in range(0,244) ]
df_tips

,customer_id,customer_name,total_bill,tip,sex,smoker,day,time,size,name
0,CUST_1001,Jennifer Peterson,16.99,1.01,Female,No,Sun,Dinner,2,Brittany Hernandez
1,CUST_1002,Mrs. Monique Vance,10.34,1.66,Male,No,Sun,Dinner,3,Patrick White
2,CUST_1003,Angelica West,21.01,3.50,Male,No,Sun,Dinner,3,Katherine Collins
3,CUST_1004,Courtney Horne,23.68,3.31,Male,No,Sun,Dinner,2,Alexis Thompson
4,CUST_1005,John Young,24.59,3.61,Female,No,Sun,Dinner,4,Amber Hodge
...,...,...,...,...,...,...,...,...,...,...
239,CUST_1240,Molly Spencer,29.03,5.92,Male,No,Sat,Dinner,3,Jonathan Thompson
240,CUST_1241,Jenna White,27.18,2.00,Female,Yes,Sat,Dinner,2,Amy Leblanc
241,CUST_1242,Shawn Krueger,22.67,2.00,Male,Yes,Sat,Dinner,2,Shelly Parker
242,CUST_1243,Stacy Mccoy,17.82,1.75,Male,No,Sat,Dinner,2,Tiffany Diaz
243,CUST_1244,Katherine Murphy,18.78,3.00,Female,No,Thur,Dinner,2,Kathryn Huynh